#+title: Serving a knative function on the root
#+subtitle: root to services
#+tags[]: kubernetes, knative, kourier
#+date: 2021-12-01
#+aliases[]: /articles/2021/serving_a_knative_function_on_the_root

I want to deploy everything as a knative service, including the root
of the domain.

*Update*: I found an easyier way.

** Find the ip

#+begin_src bash :results output
  kubectl --namespace ingress-nginx get service ingress-nginx-controller -o json| jq ".status.loadBalancer.ingress[0].ip"
#+end_src

#+RESULTS:
: "137.184.240.185"

** Create DNS entry

#+begin_src bash :results output
  doctl compute domain records create gitgratitude.com --record-type A --record-data 137.184.240.185 --record-name \@
#+end_src

#+RESULTS:
: ID           Type    Name    Data               Priority    Port    TTL     Weight
: 280663245    A       @       137.184.240.185    0           0       1800    0

** Setup the proxy service

#+begin_src yaml :tangle proxy.yaml
  kind: Deployment
  apiVersion: apps/v1
  metadata:
    name: homepage-proxy
  spec:
    replicas: 1
    selector:
      matchLabels:
        app: homepage-proxy
    template:
      metadata:
        labels:
          app: homepage-proxy
      spec:
        containers:
          - name: homepage-proxy
            image: ghcr.io/wschenk/proxy
            imagePullPolicy: Always
            ports:
              - containerPort: 3000
                name: http
            env:
            - name: REMOTE_TARGET
              value: http://homepage.default.svc.cluster.local

  ---
  apiVersion: v1
  kind: Service
  metadata:
    name: homepage-proxy

  spec:
    ports:
      - protocol: TCP
        port: 80
        targetPort: http
    selector:
      app: homepage-proxy
#+end_src

#+begin_src bash :results output
  kubectl apply -f proxy.yaml
#+end_src

#+RESULTS:
: deployment.apps/homepage-proxy configured
: service/homepage-proxy unchanged

* Create =ingress.yaml=

=ingress.yaml=:
#+begin_src yaml :tangle ingress.yaml
  apiVersion: networking.k8s.io/v1
  kind: Ingress
  metadata:
    name: gitgratitude-root
    annotations:
      # add an annotation indicating the issuer to use.
      cert-manager.io/cluster-issuer: letsencrypt-prod-nginx
      kubernetes.io/tls-acme: "true"
  spec:
    ingressClassName: nginx
    tls:
      - hosts:
        - gitgratitude.com
        secretName: gratitude-root-tls
    rules:
      - host: gitgratitude.com
        http:
          paths:
            - path: /
              pathType: Prefix
              backend:
                service:
                  name:  homepage-proxy
                  port:
                    number: 80
#+end_src

#+begin_src bash :results output
  kubectl apply -f ingress.yaml
#+end_src

#+RESULTS:
: ingress.networking.k8s.io/gitgratitude-root configured

* Testing

#+begin_src bash :results output
kn service update helloworld-go --env TARGET="World"
#+end_src

#+begin_src bash :results output
  curl https://gitgratitude.com
#+end_src

#+RESULTS:
: Hello World!

#+begin_src bash :results output
kn service update helloworld-go --env TARGET="from knative"
#+end_src

#+begin_src bash :results output
  curl https://gitgratitude.com
#+end_src

#+RESULTS:
: Hello from knative!

